SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE VIEW [dbo].[报价子表关联视图] AS SELECT
  [报价历史记录子表].[需求单ID], 	
	[需求详情合并视图].[客户名称], 
	[询价需求单].[业务代码], 
	[报价历史记录子表].[三方识别码], 
	[需求详情合并视图].[带宽], 
	[需求详情合并视图].[IP地址个数], 
	[需求详情合并视图].[线路地址], 
	[需求详情合并视图].[线路类型], 
	[需求详情合并视图].[特别需求], 
	[询价需求单].[采购负责人],
	[需求详情合并视图].[指定服务商], 
	ISNULL(gys.[公司名称], '未知' ) AS 供应商名称, 
	[报价历史记录子表].[币种],
	[报价历史记录子表].[一次性费用],
	[报价历史记录子表].[一次性费用_税率], 
	[报价历史记录子表].[一次性费用_含税价], 
	[报价历史记录子表].[周期费用], 
	[报价历史记录子表].[周期费用_税率], 
	[报价历史记录子表].[周期费用_含税价], 
	[报价历史记录子表].[周期单位], 
	[报价历史记录子表].[报价描述],
	[需求详情合并视图].[是否整单报价],
	[报价历史记录子表].FGC_CreateDate  AS 报价日期
FROM
	dbo.[报价历史记录子表]
	LEFT JOIN
	dbo.[需求详情合并视图]
	ON 
		[报价历史记录子表].[三方识别码] = [需求详情合并视图].[三方识别码]
	LEFT JOIN
	dbo.[询价需求单]
	ON 
		[报价历史记录子表].[需求单ID] = [询价需求单].ID 
	LEFT JOIN  [供应商表] gys ON [报价历史记录子表].[供应商ID] = gys.ID
		
	WHERE 	([报价历史记录子表].[一次性费用] > 0 OR [报价历史记录子表].[周期费用] > 0 OR [报价历史记录子表].[报价描述] is NOT NULL) 
					AND [报价历史记录子表].FGC_CreateDate >= '2024-05-01'
